{
    "fatigue": "How much the firing threshold increases immediately after the neuron fires. Higher fatigue means the neuron needs more rest before firing again (Simulates biological depletion).",
    "recovery": "How fast the threshold returns to normal after fatigue. Detailed: If a neuron is fatigued (threshold > base), it recovers by this amount every tick.",
    "decay": "How quickly the neuron forgets its input. A factor of 0.9 means it keeps 90% of its charge each tick. 1.0 means perfect memory (no decay), 0.0 means instant amnesia.",
    "hebbianLearning": "Neuroplasticity: 'Cells that fire together, wire together.' If enabled, connections between active nodes will grow stronger over time.",
    "learningRate": "How fast the connection weights change when Hebbian Learning occurs. Higher values mean faster adaptation but less stability.",
    "pruningThreshold": "The 'Use it or Lose it' rule. If a connection's weight drops below this value (due to disuse or anti-hebbian decay), it will be permanently removed.",
    "synapsesPerNode": "Density of internal connections. When you create a Brain module, each neuron will start with roughly this many random connections to its neighbors.",
    "maxPotential": "The safety ceiling for neuron charge. Prevents mathematical explosions if inputs get too high.",
    "synapticScaling": "Homeostasis (Balance). The 'Budget Rule'. Ensures a neuron's total incoming connection strength stays within a fixed limit (Target Sum), preventing epilepsy (runaway feedback loops).",
    "targetSum": "The Energy Budget. The total amount of 'attention' a neuron is allowed to receive from all its neighbors combined.",
    "adaptiveThreshold": "Homeostasis (Boredom). The 'Sensitivity Rule'. If a neuron never fires, it lowers its threshold to become more sensitive. If it fires too much, it raises its shield.",
    "targetRate": "The ideal firing rate for Adaptive Thresholds. The neuron tries to adjust its sensitivity to fire this many times per tick (e.g. 0.05 = once every 20 ticks).",
    "adaptationSpeed": "How fast the Adaptive Threshold changes. Lower is more stable/slow, Higher is more reactive.",
    "isLocalized": "Spatial Awareness. If enabled, neurons prefer to connect to close neighbors rather than random distant ones.",
    "moduleName": "Unique identifier for this module.",
    "moduleColor": "Visual color tint for the module nodes.",
    "nodeCount": "Total number of neurons in this module.",
    "layerDepth": "Number of columns (Layers only).",
    "conceptToggle": "Collapsed visualization (triangle view).",
    "brainRadius": "Physical size of the brain area on the canvas.",
    "vSpacing": "Vertical spread of nodes (Height).",
    "hSpacing": "Horizontal spread of columns (Width).",
    "inputPattern": "Auto-generated signal pattern (Pulse, Sin Wave, Noise).",
    "inputFrequency": "Signal frequency per tick (Noise) or Hz factor (Sin).",
    "firingThreshold": "Voltage required to fire (Lower = Sensitive).",
    "inputGain": "Multiplier for incoming connection weights.",
    "refractoryPeriod": "Cooldown ticks after firing before a neuron can fire again.",
    "leakRate": "Signal loss per tick (0.01 = 1% loss).",
    "fatigueJump": "Threshold increase immediately after firing.",
    "recoveryRate": "Threshold recovery amount per tick.",
    "hebbianToggle": "Auto-adjust weights based on activity (Fire together, wire together).",
    "pruningThresh": "Remove connections if weight drops below this value (absolute).",
    "regrowthRate": "Probability of forming new random connections per tick.",
    "initialWeightModifier": "Target Consensus Ratio. (e.g. 0.2 = Neurons fire if 20% of inputs are active). Auto-scales initial weights based on connection count.",
    "scalingPeriod": "Scaling Period: How often (in ticks) the network checks and applies Synaptic Scaling. Higher = better performance, Lower = more responsive homeostasis."
}